rc-web/app/controllers/machines_controller.rb

SELECT "machines".* FROM "machines"
---
  def index
    @machines = Machine.all

INSERT INTO "machines" ("name", "identifier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["identifier", "123456"], ["created_at", 2016-07-30 02:00:38 UTC], ["updated_at", 2016-07-30 02:00:38 UTC]]
---
  def create
    @machine = Machine.new(machine_params)

    respond_to do |format|
      if @machine.save

UPDATE "machines" SET "identifier" = ?, "updated_at" = ? WHERE "machines"."id" = ?  [["identifier", "123456789"], ["updated_at", 2016-07-30 02:12:15 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @machine.update(machine_params)

SELECT  "machines".* FROM "machines" WHERE "machines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def remote_control
    @machine = Machine.find(params[:id])

SELECT  "machines".* FROM "machines" WHERE "machines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_machine
      @machine = Machine.find(params[:id])