rc-web/app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "machine_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", " tt"], ["machine_id", 1], ["user_id", 1], ["created_at", 2016-07-31 20:00:15 UTC], ["updated_at", 2016-07-31 20:00:15 UTC]]
---
  def create
    @message = Message.new(message_params)
    @message.user = current_user
    if @message.save