rc-web/app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Trim Kadriu"], ["encrypted_password", "$2a$11$8t0QhT6P4lKkZ7rmEA7GCOv/fuN91i6nuFXKHTiNB4L/PygYmTgnm"], ["updated_at", 2016-07-29 02:27:25 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)